In [6]:
import pandas as pd
import sqlalchemy
import pymysql

In [7]:
# create sqlalchemy engine - using create engine method:
engine = sqlalchemy.create_engine("mysql+pymysql://root:@HelloWorld#1@localhost:3306/application")

In [9]:
# read from sql database
# df = pd.read_sql_table("customers",engine)
# read only two columns:
# df = pd.read_sql_table("customers",engine, columns=["name","phone_number"])
# df

In [10]:
# joining customers and orders table:
# query = '''
#  SELECT customers.name, customers.phone_number, orders.name, orders.amount
#  FROM customers INNER JOIN orders
#  ON customers.id=orders.customer_id
# '''
# df = pd.read_sql_query()
# df

In [12]:
# WRITING DATA FROM A DATAFRAME INTO SQL TABLE
df = pd.read_csv("customers.csv")
df

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

In [13]:
# rename columns in sql table:
df.rename(columns={
    'Customer Name': 'name',
    'Customer Phone': 'phone_number'
}, inplace=True)
df

              name  phone_number
0     rafael nadal    4567895647
1  maria sharapova     434534545
2   vladimir putin      89345345
3      kim un jong     123434456
4       jeff bezos     934534543
5     rahul gandhi      44324222

In [15]:
# write to sql database:
# df.to_sql(
#     name='customers', # database table name
#     con=engine,
#     if_exists='append',
#     index=False
# )